[
{
    "title" : "17 Things I\"m Not Allowed to Do Anymore",
    "author" : "Jenny Offill",
    "publisher" : "Schwartz & Wade",
    "description" : "17 Things I\"m Not Allowed to Do Anymore",
    "details" : "17 Things I\"m Not Allowed to Do Anymore",
    "year" : "2010",
    "language" : "english",
    "isbn10" : "9780307553973",
    "isbn13" : null,
    "categories" : null,
    "edition" : null,
    "pages" : null,
    "filetype" : "pdf",
    "tags" : "about your kids,allowed,anymore",
    "size" : "13.73 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1lVV-MmQbwupQEkAObMqm5XUQZN9XFKuW/preview"
},
{
    "title" : "Anger Management Games for Children",
    "author" : "Deborah M. Plummer",
    "publisher" : "Jessica Kingsley Publishers",
    "description" : "This practical handbook helps adults to understand, manage and reflect constructively on children\"s anger.",
    "details" : "This practical handbook helps adults to understand, manage and reflect constructively on children\"s anger. Featuring a wealth of familiar and easy-to-learn game, it is designed to foster successful anger management strategies for children aged 5-12.This book covers the theory behind the games in accessible language, and includes a broad range of enjoyable activities: active and passive, verbal and non-verbal, and for different sized groups. The games address issues that might arise in age-specific situations such as sharing a toy or facing peer pressure. They also encourage children to approach their emotions as a way to facilitate personal growth and healthy relationships.This is an ideal resource for teachers, parents, carers and all those working with anger management in children.",
    "year" : "2008",
    "language" : "english",
    "isbn10" : null,
    "isbn13" : "9781846427756",
    "categories" : null,
    "edition" : "1st",
    "pages" : "163",
    "filetype" : "pdf",
    "tags" : "about your kids,anger management",
    "size" : "1.17 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1ZzLkao6PsBi0Cx8gJJTe5rM0-Kf-tys_/preview"
},
{
    "title" : "Brain Training",
    "author" : "DK",
    "publisher" : "DK, Dorling Kindersley",
    "description" : "Brain Training: Boost Memory, Maximize Mental Agility, & Awaken Your Inner Genius",
    "details" : "Brain Training is an easy-to-digest collection of puzzles and tips to help exercise the brain and keep the cognitive faculties razor-sharp. Brain Training covers key areas of brain function, including memory, perception, problem-solving, verbal reasoning, and the body (how diet, exercise, meditation and other physical and mental fillips can raise brainpower). Each chapter then concentrates on a specific brain function, beginning with a lively explanation of how it works and then offers the most effective prescriptions available to exercise that particular mental function. For those who are struggling with memory, those having trouble learning new things, or those facing the pressures of exams - in fact, by anyone who wishes to maximize their cognitive potential - Brain Training is an indispensable resource to get the flabbiest brain fighting fit once again.",
    "year" : "2009",
    "language" : "english",
    "isbn10" : null,
    "isbn13" : "0756668719",
    "categories" : null,
    "edition" : "1st",
    "pages" : "194",
    "filetype" : "pdf",
    "tags" : "about your kids,anger management",
    "size" : "18.77 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1nZp8qKCnkmBetet0V9RtDAimoyAqq9Rk/preview"
},
{
    "title" : "Calm: Mindfulness for Kids",
    "author" : "Wynne Kinder",
    "publisher" : "DK Children",
    "description" : "Teach your kids how to focus their thoughts and notice the world around them with this fun mindfulness kids activity book.",
    "details" : "Calm: Mindfulness for Kids has everything you need to know about focusing your child\"s mind to help them enjoy and appreciate things that they take for granted every day, while boosting their confidence and self-esteem. Children are guided through each activity, to make sure they achieve maximum enjoyment and awareness. All children will learn and react to each activity in a different way and parent\"s notes give advice on how to encourage children to embrace mindfulness in the modern world. Each specially designed activity is flexible for each child\"s needs and inspires them to seek calmness and tranquility in all situations.",
    "year" : "2019",
    "language" : "english",
    "isbn10" : "1465470905",
    "isbn13" : "9781465470904",
    "categories" : "Physical Education and Sport",
    "edition" : "1st",
    "pages" : "74",
    "filetype" : "pdf",
    "tags" : "about your kids,mindfulness",
    "size" : "18.91 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1ZEhigVESUymJrzmkAPRpfv_8en4R2VMs/preview"
},
{
    "title" : "Helping Children to Improve Their Communication Skills",
    "author" : "Deborah M. Plummer (Illustrated by: Alice Harper)",
    "publisher" : "Jessica Kingsley Publishers",
    "description" : "Helping Children to Improve Their Communication Skills: Therapeutic Activities for Teachers, Parents and Therapists",
    "details" : "For many children, the act of communication which most of us take for granted can be a struggle, and communicating with others can become something to fear rather than enjoy. This creative book is full of fun and imaginative ideas to help children aged 4-11 with a speech or language delay or disorder to develop their communication skills. It is packed with activities and games specifically tailored to help develop skills such as articulation, vocabulary development, breath control, conversation skills and non-verbal communication. Tips for personalising and shaping the activities are also provided. A comprehensive theory section supports the ideas presented, and practical advice on working with groups and individuals and in different settings is also given. This activity book will be an invaluable resource not only for speech and language therapists and students, but also for parents, teachers, carers and other support staff who are looking for creative ways to promote language development.",
    "year" : "2011",
    "language" : "english",
    "isbn10" : "184310959X",
    "isbn13" : "9781843109594",
    "categories" : "Physical Education and Sport",
    "edition" : "1st",
    "pages" : "74",
    "filetype" : "pdf",
    "tags" : "about your kids,mindfulness",
    "size" : "1.41 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1HND8QnWAOLysiQHhVVoqwobtRtaGrdhH/preview"
},
{
    "title" : "Mind maps for kids: the shortcut to success at school",
    "author" : "Tony Buzan",
    "publisher" : "Thorsons",
    "description" : "Mind maps for kids: the shortcut to success at school",
    "details" : "Mind Mapping is a breakthrough system of planning and note-taking that cuts homework time in half and makes schoolwork fun. Mind Maps for Kids is Tony Buzan\"s first book written specially for a younger audience, suitable for ages 7 to 14. Tony Buzan has been teaching children all over the world for the past thirty years and has proved that Mind Maps are the magic formula in the classroom: remembering facts and figures is a piece of cake, planning is a doddle and getting stuck for an answer is a thing of the past. In Mind Maps for Kids, Tony Buzan explains this amazing system using step-by-step examples in every subject across the curriculum. He shows just how easy Mind Mapping is and how it can help kids to \/ remember things and concentrate better \/ make clearer and better notes \/ revise and ace exams! \/ come up with ideas and unlock the imagination / save time Mind Maps for Kids is a full-colour workbook, with the emphasis on having fun. As well as tips for improving memory and concentration, the book is packed with jokes, cartoons and brainteasers. Mind Mapping is the shortcut to success that puts kids one step (and sometimes miles!) ahead.",
    "year" : "2011",
    "language" : "english",
    "isbn10" : "0007151330",
    "isbn13" : "9780007151332",
    "categories" : null,
    "edition" : "1st",
    "pages" : "113",
    "filetype" : "pdf",
    "tags" : "about your kids,Mind maps for kids",
    "size" : "17.53 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1sP-zp-3DR5RI7lxjzHRHA4ztzlaDKhJr/preview"
},
{
    "title" : "My Mixed Emotions: Help Your Kids Handle Their Feelings",
    "author" : "Elinor Greenwood",
    "publisher" : "DK Publishing : DK Children",
    "description" : "My Mixed Emotions: Help Your Kids Handle Their Feelings",
    "details" : "This super-useful book is packed with helpful hints, tips, and techniques showing children how to recognize and express their emotions. Feelings can be tricky, soMy Mixed Emotionsis here to coach children through a variety of situations including dealing with bullying, grief, and how to cope if your family splits up. Divided into happiness, fear, anger, and sadness,My Mixed Emotionsexplores the four main emotions, the reasons why we feel them, and the science behind each one. Children will discover great things about themselves, such as what happens in their brain when they are happy, why they cry when they are sad, and why they sometimes feel nervous. My Mixed Emotionswill become a friend and guide as children travel through the mixed-up world of emotions to discover the wonderful, unique person that they are.",
    "year" : "2018",
    "language" : "english",
    "isbn10" : "0241323762",
    "isbn13" : "9780241323762",
    "categories" : null,
    "edition" : "Hardcover",
    "pages" : "113",
    "filetype" : "pdf",
    "tags" : "about your kids,My Mixed Emotions",
    "size" : "17.81 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1kBSb0DDmU48GkhbgHtOg5aURP9fYzopN/preview"
},
{
    "title" : "Please and Thank You",
    "author" : "Elinor Greenwood",
    "publisher" : "DK Publishing : DK Children",
    "description" : "These colorful books use friendly images and rhyming text to encourage kids to develop good behavior patterns.",
    "details" : "These colorful books use friendly images and rhyming text to encourage kids to develop good behavior patterns. As an added incentive, each title comes with a sheet of star stickers and a special reward chart. Each time kids meet one of the goals, a star goes on the chart! Specially designed for parents and preschoolers to enjoy together, this is the perfect book for teaching children good manners.",
    "year" : "2007",
    "language" : "english",
    "isbn10" : "0756622875",
    "isbn13" : "9780756622879",
    "categories" : null,
    "edition" : null,
    "pages" : "12",
    "filetype" : "pdf",
    "tags" : "about your kids,Please and Thank You",
    "size" : "16.15 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1FjcU6qAN9k5LX8J-iJ2v6wbUFcPuxkUI/preview"
},
{
    "title" : "Raising Gifted Kids",
    "author" : "Dr. Barbara Klein",
    "publisher" : "AMACOM",
    "description" : "Raising Gifted Kids: Everything You Need to Know to Help Your Exceptional Child Thrive",
    "details" : "While it can be rewarding to raise an extremely bright child -- quick, curious, sensitive, and introspective -- it\"s also a daunting challenge. Parents need insight into their own motivations (as well as those of their children), and the courage and ability to make tough decisions about their child\"s development. Raising Gifted Kids will help parents understand and cope with the obstacles they face in raising a gifted child, and help them make the best choices for their son\"s or daughter\"s growth and happiness.",
    "year" : "2007",
    "language" : "english",
    "isbn10" : "0814473423",
    "isbn13" : "9780756622879",
    "categories" : "Psychology",
    "edition" : "1",
    "pages" : "12",
    "filetype" : "pdf",
    "tags" : "about your kids,Raising Gifted Kids",
    "size" : "2.26 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1qt9pI9kTYkq36ZslkLduUwnH5UGbbHSl/preview"
},
{
    "title" : "Self-Esteem Games for Children",
    "author" : "Jessica Kingsley Publishers",
    "publisher" : "AMACOM",
    "description" : "In this practical handbook, self-esteem expert Deborah Plummer offers a wealth of familiar and easy-to-learn games carefully chosen to build and maintain self-esteem in children aged 5-11.",
    "details" : "In this practical handbook, self-esteem expert Deborah Plummer offers a wealth of familiar and easy-to-learn games carefully chosen to build and maintain self-esteem in children aged 5-11. The selection of games reflects the seven key elements of healthy self-esteem - self-knowledge, self and others, self-acceptance, self-reliance, self-expression, self-confidence and self-awareness - and includes opportunities for thinking and discussion. The book combines physically active and passive games, verbal and non-verbal games and games for pairs or groups, which makes them equally accessible for children with speech/language difficulties or those with physical disabilities. Deborah Plummer shows that the games can be easily adapted and she encourages readers to be creative in inventing their own alternative versions. This is an ideal resource for teachers, parents, carers and all those working to nurture self-esteem in children.",
    "year" : "2007",
    "language" : "english",
    "isbn10" : "1843104245",
    "isbn13" : "9781846425745",
    "categories" : "Psychology",
    "edition" : "1",
    "pages" : "145",
    "filetype" : "pdf",
    "tags" : "about your kids,Self-Esteem Games for Children",
    "size" : "800 KB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1Qwhp-TxfFkSDy2T0dozXcLXZFubMFfcL/preview"
},
{
    "title" : "The Top 50 Questions Kids Ask (3rd through 5th Grade)",
    "author" : "Jessica Kingsley Publishers",
    "publisher" : "AMACOM",
    "description" : "Praise for the Top 50 Questions Kids Ask \"If you\"ve ever been stumped by a question your child has asked you, this book will help.",
    "details" : "Praise for the Top 50 Questions Kids Ask \"If you\"ve ever been stumped by a question your child has asked you, this book will help. Dr. Bartell identifies the \"hot-button\" questions that consistently come up and actually provides the best possible answers to those questions so parents don\"t have to come up with them on their own on the spur of the moment\" -Elisa Ast All, co-founder, iParenting Media and executive editor, Disney Mom & Family Portfolio \"Finally, a book that answers all those questions we parents go in a cold sweat about! Dr. Susan tackles the tough ones such as money, shyness, siblings and religion. Plus, we get the psychology behind it all to better understand our kids.",
    "year" : "2010",
    "language" : "english",
    "isbn10" : "1402219164",
    "isbn13" : "9781402219160",
    "categories" : "Psychology",
    "edition" : "1",
    "pages" : "256",
    "filetype" : "pdf",
    "tags" : "about your kids,The Top 50 Questions Kids Ask (3rd through 5th Grade)",
    "size" : "2.73 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1Kqy3MPs60TJzUfQXf00C9lV4otFFmdke/preview"
},
{
    "title" : "The Top 50 Questions Kids Ask (Pre-K through 2nd Grade)",
    "author" : "Jessica Kingsley Publishers",
    "publisher" : "AMACOM",
    "description" : "The Top 50 Questions Kids Ask is an insightful guide on the issues and concerns every parent and child faces. It\"s a must- read guide that both moms and dads should keep at their bedside.",
    "details" : "The Top 50 Questions Kids Ask is an insightful guide on the issues and concerns every parent and child faces. It\"s a must- read guide that both moms and dads should keep at their bedside.",
    "year" : "2010",
    "language" : "english",
    "isbn10" : "1402219156",
    "isbn13" : "9781402219153",
    "categories" : "Psychology",
    "edition" : "1",
    "pages" : "256",
    "filetype" : "pdf",
    "tags" : "about your kids,The Top 50 Questions Kids Ask (Pre-K through 2nd Grade)",
    "size" : "2.23 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1mabQ-sXJWjGw77Sk-NdQogWFm2EHdmGJ/preview"
},
{
    "title" : "What\"s My Child Thinking",
    "author" : "Eileen Kennedy-Moore, Tanith Carey",
    "publisher" : "Dorling Kindersley",
    "description" : "What\"s My Child Thinking?: Practical Child Psychology for Modern Parents",
    "details" : "What\"s My Child Thinking?: Practical Child Psychology for Modern Parents",
    "year" : "2010",
    "language" : "english",
    "isbn10" : null,
    "isbn13" : "9780241343807",
    "categories" : "Psychology",
    "edition" : "1",
    "pages" : "258",
    "filetype" : "pdf",
    "tags" : "about your kids,Whats My Child Thinking",
    "size" : "22.49 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1or1YaepAynkzWLabLBo3wNDGmng4LVvj/preview"
},
{
    "title" : "What\"s My Teenager Thinking?",
    "author" : "Tanith Carey",
    "publisher" : "Penguin Random House",
    "description" : "What\"s My Teenager Thinking?: Practical Child Psychology for Modern Parents",
    "details" : "What\"s My Teenager Thinking?: Practical Child Psychology for Modern Parents",
    "year" : "2010",
    "language" : "english",
    "isbn10" : null,
    "isbn13" : "9780241389461",
    "categories" : "Psychology",
    "edition" : "1",
    "pages" : "217",
    "filetype" : "pdf",
    "tags" : "about your kids,What\"s My Teenager Thinking?",
    "size" : "17.51 MB",
    "type" : "kids",
    "isfeatured" : false,
    "gdrive_url" : "https://drive.google.com/file/d/1dfOuGeli26v4s4BhiE1LmhHI6S39j00a/preview"
}
]